[
    {
        "name": "Khalid Mafton",
        "coment": "I had an excellent experience with Ehsan Law. From the very beginning, their team was knowledgeable, professional, and genuinely cared about my case. They took the time to explain every step clearly and made sure I understood all my options before moving forward.\nEhsan was attentive, detail-oriented, and always quick to respond to my questions. I truly felt that my case was in capable hands. Thanks to his dedication and expertise, everything was handled smoothly and successfully.",
        "star": 5
    },
    {
        "name": "Mohsen Sadeghi",
        "coment": "Ehsan Law helped us with  an important immigration filing. They were thorough, organized, and quick to respond to all follow-up questions. Their guidance helped us avoid mistakes and proceed with confidence. Highly recommend them.",
        "star": 5
    },
    {
        "name": "S.S",
        "coment": "I needed immediate attention to my immigration case, I was so glad that the entire Ehsan Law Firm staff and attorneys were super fast and helpful. It’s obvious that they genuinely care and know what they are doing. I will always be grateful and highly recommend them to others.",
        "star": 5
    },
    {
        "name": "abdul samad noorzad",
        "coment": "Friendly office, clear email replies, and an attorney who genuinely listened to my concerns about timing and travel. They prepared my forms carefully, double-checked evidence, and explained what to expect at each stage. Their steady communication kept me calm during the waiting period. Overall a supportive and competent immigration practice.",
        "star": 5
    },
    {
        "name": "nasim hajizada",
        "coment": "I had an urgent question and called Ehsan Law — they took my details, and then I was contacted by an attorney who answered my questions and addressed my concerns. I greatly appreciated their quick and hands-on approach. It shows that they have a very strong team work and are invested in a positive outcome.",
        "star": 5
    }

]